; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	spectrograph1 - mode
	spectrograph2 - mode
	image0 - mode
	GroundStation0 - direction
	Star1 - direction
	GroundStation4 - direction
	Star5 - direction
	GroundStation7 - direction
	Star9 - direction
	GroundStation10 - direction
	Star2 - direction
	GroundStation8 - direction
	GroundStation3 - direction
	Star6 - direction
	Planet11 - direction
	Planet12 - direction
	Phenomenon13 - direction
	Planet14 - direction
	Phenomenon15 - direction
	Phenomenon16 - direction
	Star17 - direction
	Planet18 - direction
)
(:init
	(supports instrument0 image0)
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 GroundStation3)
	(supports instrument1 spectrograph1)
	(supports instrument1 image0)
	(calibration_target instrument1 Star2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation4)
	(supports instrument2 spectrograph2)
	(supports instrument2 image0)
	(calibration_target instrument2 GroundStation8)
	(supports instrument3 spectrograph1)
	(supports instrument3 image0)
	(calibration_target instrument3 Star6)
	(calibration_target instrument3 GroundStation3)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet12)
)
(:goal (and
	(pointing satellite0 Star6)
	(pointing satellite1 Phenomenon16)
	(have_image Planet11 spectrograph1)
	(have_image Planet12 image0)
	(have_image Phenomenon13 spectrograph1)
	(have_image Planet14 spectrograph1)
	(have_image Phenomenon15 image0)
	(have_image Phenomenon16 spectrograph1)
	(have_image Star17 image0)
	(have_image Planet18 spectrograph1)
))

)

; plan
1. (turn_to satellite1 groundstation3 planet12)
   deleted: (pointing satellite1 planet12)
   added: (pointing satellite1 groundstation3)
   goals met: 0 of 10
2. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 10
3. (calibrate satellite1 instrument3 groundstation3)
   added: (calibrated instrument3)
   goals met: 0 of 10
4. (turn_to satellite1 planet11 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 planet11)
   goals met: 0 of 10
5. (take_image satellite1 planet11 instrument3 spectrograph1)
   added: (have_image planet11 spectrograph1)
   goals met: 1 of 10
6. (turn_to satellite1 phenomenon15 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 phenomenon15)
   goals met: 1 of 10
7. (take_image satellite1 phenomenon15 instrument3 image0)
   added: (have_image phenomenon15 image0)
   goals met: 2 of 10
8. (turn_to satellite1 phenomenon13 phenomenon15)
   deleted: (pointing satellite1 phenomenon15)
   added: (pointing satellite1 phenomenon13)
   goals met: 2 of 10
9. (turn_to satellite0 star6 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 star6)
   goals met: 3 of 10
10. (take_image satellite1 phenomenon13 instrument3 spectrograph1)
   added: (have_image phenomenon13 spectrograph1)
   goals met: 4 of 10
11. (turn_to satellite1 planet12 phenomenon13)
   deleted: (pointing satellite1 phenomenon13)
   added: (pointing satellite1 planet12)
   goals met: 4 of 10
12. (take_image satellite1 planet12 instrument3 image0)
   added: (have_image planet12 image0)
   goals met: 5 of 10
13. (turn_to satellite1 planet14 planet12)
   deleted: (pointing satellite1 planet12)
   added: (pointing satellite1 planet14)
   goals met: 5 of 10
14. (take_image satellite1 planet14 instrument3 spectrograph1)
   added: (have_image planet14 spectrograph1)
   goals met: 6 of 10
15. (turn_to satellite1 planet18 planet14)
   deleted: (pointing satellite1 planet14)
   added: (pointing satellite1 planet18)
   goals met: 6 of 10
16. (take_image satellite1 planet18 instrument3 spectrograph1)
   added: (have_image planet18 spectrograph1)
   goals met: 7 of 10
17. (turn_to satellite1 star17 planet18)
   deleted: (pointing satellite1 planet18)
   added: (pointing satellite1 star17)
   goals met: 7 of 10
18. (take_image satellite1 star17 instrument3 image0)
   added: (have_image star17 image0)
   goals met: 8 of 10
19. (turn_to satellite1 phenomenon16 star17)
   deleted: (pointing satellite1 star17)
   added: (pointing satellite1 phenomenon16)
   goals met: 9 of 10
20. (take_image satellite1 phenomenon16 instrument3 spectrograph1)
   added: (have_image phenomenon16 spectrograph1)
   goals met: 10 of 10
